package ch07_loops;
/*
    while 반복문
    형식 :
    while(조건식) {
        반복실행문
    }
    while 뒤에 나오는 (조건식)을 봤을 때 if(조건식) 형태와 유사합니다.
    즉, while() 내의 조건식이 true일 때, {} 내의 실행문이 '반복적으로' 이루어집니다.

    그래서 주의할 점이 있는데
    while 내부의 조건식이 특정 시점에 false가 되도록
    미리 설계를 해둘 필요가 있습니다.

     false가 되는 시점을 지정해주지 않는다면 계속 true 상태가 유지되어
     반복 실행문이 무한히 계속되기 때문에
     무한 루프라는 표현을 씁니다.

    https://www.notion.so/3-22-1-25-1-233bde249a06801c880edd6468a7ce28

    금일 추천 복습 목록

    조건문
        종류
        1. if관련
        2. switch관련

        Java 관련 말고 정보처리(산업)기사 관련 정보 수집 - 시험 신청일 /기출 사이트 etc
        SQLD 마찬가지





 */


public class loops {


}
